/****************************************************************************
 *
 * MODULE:             reversion.h
 *
 * COMPONENT:          linux kernel interface
 *
 * REVISION:           $Revision:  1.0$
 *
 * DATED:              $Date: 2016-12-06 15:13:17 +0100 (Fri, 12 Dec 2016 $
 *
 * AUTHOR:             PCT
 *
 ****************************************************************************
 *
 * Copyright panchangtao@gmail.com 2016. All rights reserved
 *
 ***************************************************************************/
/****************************************************************************/
/***        Include files                                                 ***/
/****************************************************************************/
#include <linux/init.h>
#include <linux/module.h>
#include <linux/moduleparam.h>
#include <linux/cdev.h>
#include <linux/fs.h>
#include <asm/uaccess.h>
//#include <asm/semaphore.h>
/****************************************************************************/
/***        Macro Definitions                                             ***/
/****************************************************************************/
#define print(x,ARGS...) printk(KERN_DEBUG x,##ARGS)

#define REVERSION_MAJOR 0	//设备的主设备号，为0表示系统分配
#define REVERSION_MINOR 0	//设备的次设备号
#define REVERSION_NR_DEVS 1 //设备的个数
#define REVERSION_NAME "reversion"
/****************************************************************************/
/***        Local Variables                                               ***/
/****************************************************************************/


/****************************************************************************/
/***        Local    Functions                                            ***/
/****************************************************************************/
